Khalilpour/0.orig/shell/C2H6
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C2H6;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.1793;

boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform 0.1793;
        }

        outlet
        {
            type            zeroGradient;
            /*type            inletOutlet;
            inletValue      uniform 0;
            value           uniform 0.9;*/
        }

        wall
        {
            type            empty;
        }

        upAndDown
        {
            type            empty;
        }
    }


// ************************************************************************* //
