Khalilpour/0.orig/shell/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.3506;

boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform 0.3506;
        }

        outlet
        {
            type            zeroGradient;
            /*type            inletOutlet;
            inletValue      uniform 0;
            value           uniform 0.1;*/
        }

        wall
        {
            type            empty;
        }
     
        upAndDown
        {
            type            empty;
        }
    }
// ************************************************************************* //
