Khalilpour/0.orig/tubes/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.7;

boundaryField
    {
        inlet
        {
            type            zeroGradient;
            /*type            fixedValue;
            value           uniform 0.3;*/
        }

        outlet
        {
            type            zeroGradient;
            /*type            inletOutlet;
            inletValue      uniform 0;
            value           uniform 0;*/
        }

        wall
        {
            type            empty;
        }

        upAndDown
        {
            type            empty;
        }
    }


// ************************************************************************* //
