Khalilpour/0.orig/tubes/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
    {
        inlet
        {
            type            zeroGradient;
            //value           uniform (0 0 -0.0001);
        }
        
        outlet
        {
            type            noSlip;
            /*type            inletOutlet;
            value           uniform (0 0 0);
            inletValue      uniform (0 0 0);*/
        }
        
        wall
        {
            type            empty;
        }
        
        upAndDown
        {
            type            empty;
        }
    }


// ************************************************************************* //
