Khalilpour/0.orig/tubes/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.0300e5;

boundaryField
    {
        inlet
        {
            type            calculated;
            value           uniform 1e5;
        }
        
        outlet
        {
            type            calculated;
            value           uniform 1e5;
        }
        
        wall
        {
            type            empty;
        }

        upAndDown
        {
            type            empty;
        }
    }


// ************************************************************************* //
