Khalilpour/0.orig/tubes/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform 1.03000e5;
        }
        
        outlet
        {
            type            zeroGradient;
        }
        
        wall
        {
            type            empty;
        }

        upAndDown
        {
            type            empty;
        }
    }


// ************************************************************************* //
