Khalilpour/constant/shell/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
n ;//Number of hollow fibers
ro ;//Fiber outer radius
Lwet ;//Wet fiber length
L ;//Fiber length
Rs ;//Shell radius
rho ;
c 0.08166;//Constant for hexagonal arrangement of fibers

eps #calc "1-($n*$ro^2*$Lwet/($Rs^2*$L))";//Porosity of shell region
phi #calc "1-$eps";//Fraction of volume occupied by fibers
kappaA #calc "(($ro^2*$L^2)/(4*$phi*$Lwet^2*$eps))*(-ln($phi)-1.5+2*$phi-0.5*$phi^2)";//Axial Darcy permeability
kappaR #calc "($ro^2/(8*$phi*$eps))*(-ln($phi)+(($phi^2-1)/($phi^2+1)))";//Radial Darcy permeability

F #calc "$c*(1-$eps)/$eps";
fx #calc "$c*(1-$eps)/$eps";//Radial
fy #calc "$c*(1-$eps)/$eps";//Radial
fz #calc "$c*(1-$eps)/$eps";//Axial
dx #calc "$F*$rho/sqrt($kappaR)";//Radial
dy #calc "$F*$rho/sqrt($kappaR)";//Radial
dz #calc "$F*$rho/sqrt($kappaA)";//Axial
*/
porosityBlockage
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        shell;

        type            DarcyForchheimer;

        d   (-1000 -1000 2.4171e9);
        f   (0 0 0);

        coordinateSystem
        {
            origin  (0 0 0);
            e1      (1 0 0);
            e2      (0 1 0);
        }
    }
}

// ************************************************************************* //
