Khalilpour/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|k|epsilon|R|Yi)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|k|epsilon|R|Yi)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
    
    h
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0.1;
        /*minIter          1;
        maxIter          0;*/
    }

    hFinal
    {
        $h;
        tolerance        1e-08;
        relTol           0;
        /*minIter          0;
        maxIter          0;*/
    }
    
    YMap_0
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    YMap_0Final
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors 5;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    nAlphaCorr       2;

    residualControl
    {
        "Yi.*"
        {
            tolerance   1e-7;
            relTol      0;
        }
        p_rgh
        {
            tolerance   5e-6;
            relTol      0;
        }
        U
        {
            tolerance   5e-6;
            relTol      0;
        }
    }

    pRefCell    0;
    pRefValue   1e5;
}

relaxationFactors
{
    equations
    {
        p_rgh           0.8;
        "h.*"           1;
        "U.*"           0.8;
    }
}


// ************************************************************************* //
