Khalilpour/system/shell/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

HalfLength 0.5;
HalfSideLength 0.025;

vertices
(
   ( $HalfSideLength -$HalfSideLength -$HalfLength ) //0
   ( $HalfSideLength $HalfSideLength -$HalfLength ) //1
   ( -$HalfSideLength $HalfSideLength -$HalfLength )//2
   ( -$HalfSideLength -$HalfSideLength -$HalfLength )//3
   ( $HalfSideLength -$HalfSideLength $HalfLength )  //4
   ( $HalfSideLength $HalfSideLength $HalfLength )  //5
   ( -$HalfSideLength $HalfSideLength $HalfLength ) //6
   ( -$HalfSideLength -$HalfSideLength $HalfLength ) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 700) simpleGrading (1 1 1)
);

edges
(
);
boundary
(
   inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }
    wall
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
    upAndDown
    {
        type empty;
        faces
        (
            (1 2 6 5)
            (3 0 4 7)
        );
    }
 
);

mergePatchPairs
(
);

// ************************************************************************* //
